# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.22-s017_1 on Sat Oct 29 14:36:15 IST 2022

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design ieee754

create_clock -name "clk" -period 100.0 -waveform {0.0 50.0} [get_ports clk]
set_clock_transition 0.4 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {opcode[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {opcode[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in2[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {in1[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {status[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.001 [get_ports {out[31]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb2]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb1]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/adiode]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/slbhb4]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/bh01d1]
set_dont_use [get_lib_cells tsl18fs120_scl_ss/cload1]
